ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0gx218_gx207/ADC1_1MSPS_1.0.xml
        <register id="ADC1_DMA_TRIG_MIS" width="32" offset="0x18" description="Masked interrupt status extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
        <register id="ADC1_DMA_TRIG_ISET" width="32" offset="0x20" description="Interrupt set extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
        <register id="ADC1_DMA_TRIG_ICLR" width="32" offset="0x28" description="Interrupt clear extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
