ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0gx218_gx207/ADC1_1MSPS_1.0.xml
        </group>
    <register id="ADC1_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="ADC1_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="ADC1_CTL0" width="32" offset="0x1100" description="Control Register 0">
        <bitfield id="ENC" description="Enable conversion" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Conversion disabled. ENC change from ON to OFF will abort single or repeat sequence on a MEMCTLx boundary. The current conversion will finish and result stored in corresponding MEMRESx."/>
            <bitenum id="ON" value="0x1" description="Conversion enabled. ADC sequencer waits for valid trigger (software or hardware)."/>
        </bitfield>
        <bitfield id="PWRDN" description="Power down policy" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="AUTO" value="0x0" description="ADC is powered down on completion of a conversion if there is no pending trigger"/>
            <bitenum id="MANUAL" value="0x1" description="ADC remains powered on as long as it is enabled through software."/>
        </bitfield>
        <bitfield id="SCLKDIV" description="Sample clock divider" begin="26" end="24" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_4" value="0x2" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_8" value="0x3" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_16" value="0x4" description="Divide clock source by 16"/>
            <bitenum id="DIV_BY_24" value="0x5" description="Divide clock source by 24"/>
            <bitenum id="DIV_BY_32" value="0x6" description="Divide clock source by 32"/>
            <bitenum id="DIV_BY_48" value="0x7" description="Divide clock source by 48"/>
        </bitfield>
    </register>
    <register id="ADC1_CTL1" width="32" offset="0x1104" description="Control Register 1">
        <bitfield id="TRIGSRC" description="Sample trigger source" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SOFTWARE" value="0x0" description="Software trigger"/>
            <bitenum id="EVENT" value="0x1" description="Hardware event trigger"/>
        </bitfield>
        <bitfield id="SC" description="Start of conversion" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="When SAMPMODE is set to MANUAL, clearing this bit will end the sample phase and the conversion phase will start. When SAMPMODE is set to AUTO, writing 0 has no effect."/>
            <bitenum id="START" value="0x1" description="When SAMPMODE is set to MANUAL, setting this bit will start the sample phase. Sample phase will last as long as this bit is set.  When SAMPMODE is set to AUTO, setting this bit will trigger the timer based sample time."/>
        </bitfield>
        <bitfield id="CONSEQ" description="Conversion sequence mode" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="SINGLE" value="0x0" description="ADC channel in MEMCTLx pointed by STARTADD will be converted once"/>
            <bitenum id="SEQUENCE" value="0x1" description="ADC channel sequence pointed by STARTADD and ENDADD will be converted once"/>
            <bitenum id="REPEATSINGLE" value="0x2" description="ADC channel in MEMCTLx pointed by STARTADD will be converted repeatedly"/>
            <bitenum id="REPEATSEQUENCE" value="0x3" description="ADC channel sequence pointed by STARTADD and ENDADD will be converted repeatedly"/>
        </bitfield>
        <bitfield id="SAMPMODE" description="Sample mode. This bit selects the source of the sampling signal. 
MANUAL option is not valid when TRIGSRC is selected as hardware event trigger." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="AUTO" value="0x0" description="Sample timer high phase is used as sample signal"/>
            <bitenum id="MANUAL" value="0x1" description="Software trigger is used as sample signal"/>
        </bitfield>
        <bitfield id="AVGN" description="Hardware averager numerator. Selects number of conversions to accumulate for current MEMCTLx and then it is divided by AVGD. Result will be stored in MEMRESx." begin="26" end="24" width="3" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables averager"/>
            <bitenum id="AVG_2" value="0x1" description="Averages 2 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_4" value="0x2" description="Averages 4 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_8" value="0x3" description="Averages 8 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_16" value="0x4" description="Averages 16 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_32" value="0x5" description="Averages 32 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_64" value="0x6" description="Averages 64 conversions before storing in MEMRESx register"/>
            <bitenum id="AVG_128" value="0x7" description="Averages 128 conversions before storing in MEMRESx register"/>
        </bitfield>
        <bitfield id="AVGD" description="Hardware averager denominator. The number to divide the accumulated value by (this is a shift). Note result register is maximum of 16-bits long so if not shifted appropriately result will be truncated." begin="30" end="28" width="3" rwaccess="R/W">
            <bitenum id="SHIFT0" value="0x0" description="No shift"/>
            <bitenum id="SHIFT1" value="0x1" description="1 bit shift"/>
            <bitenum id="SHIFT2" value="0x2" description="2 bit shift"/>
            <bitenum id="SHIFT3" value="0x3" description="3 bit shift"/>
            <bitenum id="SHIFT4" value="0x4" description="4 bit shift"/>
            <bitenum id="SHIFT5" value="0x5" description="5 bit shift"/>
            <bitenum id="SHIFT6" value="0x6" description="6 bit shift"/>
            <bitenum id="SHIFT7" value="0x7" description="7 bit shift"/>
        </bitfield>
    </register>
    <register id="ADC1_CTL2" width="32" offset="0x1108" description="Control Register 2">
        <bitfield id="DF" description="Data read-back format. Data is always stored in binary unsigned format." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UNSIGNED" value="0x0" description="Digital result reads as Binary Unsigned."/>
            <bitenum id="SIGNED" value="0x1" description="Digital result reads Signed Binary. (2s complement), left aligned."/>
        </bitfield>
        <bitfield id="RES" description="Resolution. These bits define the resolution of ADC conversion result.
Note : A value of 3 defaults to 12-bits resolution." begin="2" end="1" width="2" rwaccess="R/W">
            <bitenum id="BIT_12" value="0x0" description="12-bits resolution"/>
            <bitenum id="BIT_10" value="0x1" description="10-bits resolution"/>
            <bitenum id="BIT_8" value="0x2" description="8-bits resolution"/>
        </bitfield>
        <bitfield id="STARTADD" description="Sequencer start address. These bits select which MEMCTLx is used for single conversion or as first MEMCTL for sequence mode. 
The value of STARTADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23." begin="20" end="16" width="5" rwaccess="R/W">
            <bitenum id="ADDR_00" value="0x0" description="MEMCTL0 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_01" value="0x1" description="MEMCTL1 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_02" value="0x2" description="MEMCTL2 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_03" value="0x3" description="MEMCTL3 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_04" value="0x4" description="MEMCTL4 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_05" value="0x5" description="MEMCTL5 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_06" value="0x6" description="MEMCTL6 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_07" value="0x7" description="MEMCTL7 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_08" value="0x8" description="MEMCTL8 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_09" value="0x9" description="MEMCTL9 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_10" value="0xA" description="MEMCTL10 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_11" value="0xB" description="MEMCTL11 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_12" value="0xC" description="MEMCTL12 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_13" value="0xD" description="MEMCTL13 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_14" value="0xE" description="MEMCTL14 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_15" value="0xF" description="MEMCTL15 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_16" value="0x10" description="MEMCTL16 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_17" value="0x11" description="MEMCTL17 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_18" value="0x12" description="MEMCTL18 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_19" value="0x13" description="MEMCTL19 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_20" value="0x14" description="MEMCTL20 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_21" value="0x15" description="MEMCTL21 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_22" value="0x16" description="MEMCTL22 is selected as start address of a sequence or for a single conversion."/>
            <bitenum id="ADDR_23" value="0x17" description="MEMCTL23 is selected as start address of a sequence or for a single conversion."/>
        </bitfield>
        <bitfield id="ENDADD" description="Sequence end address. These bits select which MEMCTLx is the last one for the sequence mode.
The value of ENDADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23." begin="28" end="24" width="5" rwaccess="R/W">
            <bitenum id="ADDR_00" value="0x0" description="MEMCTL0 is selected as end address of sequence."/>
            <bitenum id="ADDR_01" value="0x1" description="MEMCTL1 is selected as end address of sequence."/>
            <bitenum id="ADDR_02" value="0x2" description="MEMCTL2 is selected as end address of sequence."/>
            <bitenum id="ADDR_03" value="0x3" description="MEMCTL3 is selected as end address of sequence."/>
            <bitenum id="ADDR_04" value="0x4" description="MEMCTL4 is selected as end address of sequence."/>
            <bitenum id="ADDR_05" value="0x5" description="MEMCTL5 is selected as end address of sequence."/>
            <bitenum id="ADDR_06" value="0x6" description="MEMCTL6 is selected as end address of sequence."/>
            <bitenum id="ADDR_07" value="0x7" description="MEMCTL7 is selected as end address of sequence."/>
            <bitenum id="ADDR_08" value="0x8" description="MEMCTL8 is selected as end address of sequence."/>
            <bitenum id="ADDR_09" value="0x9" description="MEMCTL9 is selected as end address of sequence."/>
            <bitenum id="ADDR_10" value="0xA" description="MEMCTL10 is selected as end address of sequence."/>
            <bitenum id="ADDR_11" value="0xB" description="MEMCTL11 is selected as end address of sequence."/>
            <bitenum id="ADDR_12" value="0xC" description="MEMCTL12 is selected as end address of sequence."/>
            <bitenum id="ADDR_13" value="0xD" description="MEMCTL13 is selected as end address of sequence."/>
            <bitenum id="ADDR_14" value="0xE" description="MEMCTL14 is selected as end address of sequence."/>
            <bitenum id="ADDR_15" value="0xF" description="MEMCTL15 is selected as end address of sequence."/>
            <bitenum id="ADDR_16" value="0x10" description="MEMCTL16 is selected as end address of sequence."/>
            <bitenum id="ADDR_17" value="0x11" description="MEMCTL17 is selected as end address of sequence."/>
            <bitenum id="ADDR_18" value="0x12" description="MEMCTL18 is selected as end address of sequence."/>
            <bitenum id="ADDR_19" value="0x13" description="MEMCTL19 is selected as end address of sequence."/>
            <bitenum id="ADDR_20" value="0x14" description="MEMCTL20 is selected as end address of sequence."/>
            <bitenum id="ADDR_21" value="0x15" description="MEMCTL21 is selected as end address of sequence."/>
            <bitenum id="ADDR_22" value="0x16" description="MEMCTL22 is selected as end address of sequence."/>
            <bitenum id="ADDR_23" value="0x17" description="MEMCTL23 is selected as end address of sequence."/>
        </bitfield>
        <bitfield id="DMAEN" description="Enable DMA trigger for data transfer. 
Note: DMAEN bit is cleared by hardware based on DMA done signal at the end of data transfer. Software has to re-enable DMAEN bit for ADC to generate DMA triggers." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="DMA trigger not enabled"/>
            <bitenum id="ENABLE" value="0x1" description="DMA trigger enabled"/>
        </bitfield>
        <bitfield id="SAMPCNT" description="Number of ADC converted samples to be transferred on a DMA trigger" begin="15" end="11" width="5" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="Minimum value"/>
            <bitenum id="MAX" value="0x18" description="Maximum value"/>
        </bitfield>
        <bitfield id="FIFOEN" description="Enable FIFO based operation" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="RSTSAMPCAPEN" description="0: Sample and hold capacitor is not explicitly discharged at the end of conversion.
1: Sample and hold capacitor is discharged at the end of conversion. This incurs one additional conversion clock cycle." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable sample capacitor discharge feature."/>
            <bitenum id="ENABLE" value="0x1" description="Enable sample capacitor discharge feature."/>
        </bitfield>
    </register>
